package Ch09;

public class C00ClassInfo {

	public static void main(String[] args) {
		
		//객체 : 존재(공간을 차지하는..) 사물
		//자바의 객체(인스턴스)
		//현실 객체의 대한정보(속성/기능)의 일부를 메모리공간에 담아 놓는 상태
		
		//객체 지향
		//홍길동
		//이름,나이,주소,성별,몸무게,신장,머리카락유무,학력,경력,재력,...
		//걷는다,뛴다,말한다,먹는다,소화한다...
		
		//확인
		//에어컨
		//속성 : 로고, 재질, ...
		//기능 : 전기를 쓴다, 온도 조절, 각종 기능
		
		//나무
		//속성 : 잎, 줄기, 뿌리, 열매..
		//기능 : 광합성을한다, 열매를맺는다, 물을 흡수한다.
		
		//자동차
		//속성 : 대시보드 , 타이어, 핸들..
		//기능 : 가속한다, 감속한다, 기어변경..
		
		//컴퓨터
		//속성 : 로고, 제조사, 소유자, CPUSpec, RAMSpec...MainBoardType..
		//기능 : Power On / Power Off
		
		// 클래스
		// 객체를 생성하기 위해 미리 선언된 자료형
		// 클래스 자체로는 공간을 차지하지 않는다
		
		//Scanner sc = new Scanner(System.in)
		// new			: Heap공간에 객체 생성 (Heap : 객체전용 저장공간)
		// Scanner()	: 생성자매서드(기능)를 통한 초기값 설정
		// Scanner sc	: Scanner 클래스 자료형으로 sc라는 참조변수 생성
		
		//JAVA 메모리 영역
		//		//클래스 영역		: 공유메모리(static변수,static메서드,생성자메서드)
		//스택 영역		: 일반변수,참조변수
		//힙 영역			: 객체
		
	}

}
