package Ch02;

public class C03실수 {

	public static void main(String[] args) {
		
		//실수값 저장에 있어서 소수점 이하의 숫자의 범위는 무한대에 가깝다
		//제한적인 공간에 소수점이하의 범위를 다 담아내지 못하기 떄문에
		//실수값을 저장하는 공간은 특정한 방정식을 이용하여 근사값을 구하게 된다.
		//실수값을 반복적으로 연산처리를 하게 되면 오차가 발생할 가능성이 높다.
		//반복연산을 해야하는 실수값은 정수값으로 변환해서 처리를 하는것을 권장한다.
		
		//소수점의 위치지정 방식
		//고정 소수점 방식 : 소수점의 위치가 고정되어 값을 저장하는 방식
		//				속도는 빠르나, 메모리를 효율적으로 사용하지 못한다.
		//부동 소수점 방식 : 소수점의 위치가 저장 요청하는 값에 따라 바뀌는 방식
		//				속도는 느리나, 메모리를 효율적으로 사용한다.
		
		
		
		
		
		
		
	}

}
